Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_regdef.h
/**
 * \file IfxPsi5_regdef.h
 * \brief
 * \copyright Copyright (c) 2015 Infineon Technologies AG. All rights reserved.
 *
 * Version: TC39XA_ITS_V3.0.R0
 * Specification: tc39x_its_PSI5_MCSFR.xml
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Psi5 Psi5
 * \ingroup IfxLld
 * 
 * \defgroup IfxLld_Psi5_Bitfields Bitfields
 * \ingroup IfxLld_Psi5
 * 
 * \defgroup IfxLld_Psi5_union Union
 * \ingroup IfxLld_Psi5
 * 
 * \defgroup IfxLld_Psi5_struct Struct
 * \ingroup IfxLld_Psi5
 * 
 */
#ifndef IFXPSI5_REGDEF_H
#define IFXPSI5_REGDEF_H 1
/******************************************************************************/
#include "Ifx_TypesReg.h"
/******************************************************************************/
/** \addtogroup IfxLld_Psi5_Bitfields
 * \{  */

/** \brief  Access Enable Register 0 */
typedef struct _Ifx_PSI5_ACCEN0_Bits
{
    unsigned int EN0:1;                     /**< \brief [0:0] Access E0able for Master TAG ID n (rw) */
    unsigned int EN1:1;                     /**< \brief [1:1] Access E1able for Master TAG ID n (rw) */
    unsigned int EN2:1;                     /**< \brief [2:2] Access E2able for Master TAG ID n (rw) */
    unsigned int EN3:1;                     /**< \brief [3:3] Access E3able for Master TAG ID n (rw) */
    unsigned int EN4:1;                     /**< \brief [4:4] Access E4able for Master TAG ID n (rw) */
    unsigned int EN5:1;                     /**< \brief [5:5] Access E5able for Master TAG ID n (rw) */
    unsigned int EN6:1;                     /**< \brief [6:6] Access E6able for Master TAG ID n (rw) */
    unsigned int EN7:1;                     /**< \brief [7:7] Access E7able for Master TAG ID n (rw) */
    unsigned int EN8:1;                     /**< \brief [8:8] Access E8able for Master TAG ID n (rw) */
    unsigned int EN9:1;                     /**< \brief [9:9] Access E9able for Master TAG ID n (rw) */
    unsigned int EN10:1;                    /**< \brief [10:10] Access E10able for Master TAG ID n (rw) */
    unsigned int EN11:1;                    /**< \brief [11:11] Access E11able for Master TAG ID n (rw) */
    unsigned int EN12:1;                    /**< \brief [12:12] Access E12able for Master TAG ID n (rw) */
    unsigned int EN13:1;                    /**< \brief [13:13] Access E13able for Master TAG ID n (rw) */
    unsigned int EN14:1;                    /**< \brief [14:14] Access E14able for Master TAG ID n (rw) */
    unsigned int EN15:1;                    /**< \brief [15:15] Access E15able for Master TAG ID n (rw) */
    unsigned int EN16:1;                    /**< \brief [16:16] Access E16able for Master TAG ID n (rw) */
    unsigned int EN17:1;                    /**< \brief [17:17] Access E17able for Master TAG ID n (rw) */
    unsigned int EN18:1;                    /**< \brief [18:18] Access E18able for Master TAG ID n (rw) */
    unsigned int EN19:1;                    /**< \brief [19:19] Access E19able for Master TAG ID n (rw) */
    unsigned int EN20:1;                    /**< \brief [20:20] Access E20able for Master TAG ID n (rw) */
    unsigned int EN21:1;                    /**< \brief [21:21] Access E21able for Master TAG ID n (rw) */
    unsigned int EN22:1;                    /**< \brief [22:22] Access E22able for Master TAG ID n (rw) */
    unsigned int EN23:1;                    /**< \brief [23:23] Access E23able for Master TAG ID n (rw) */
    unsigned int EN24:1;                    /**< \brief [24:24] Access E24able for Master TAG ID n (rw) */
    unsigned int EN25:1;                    /**< \brief [25:25] Access E25able for Master TAG ID n (rw) */
    unsigned int EN26:1;                    /**< \brief [26:26] Access E26able for Master TAG ID n (rw) */
    unsigned int EN27:1;                    /**< \brief [27:27] Access E27able for Master TAG ID n (rw) */
    unsigned int EN28:1;                    /**< \brief [28:28] Access E28able for Master TAG ID n (rw) */
    unsigned int EN29:1;                    /**< \brief [29:29] Access E29able for Master TAG ID n (rw) */
    unsigned int EN30:1;                    /**< \brief [30:30] Access E30able for Master TAG ID n (rw) */
    unsigned int EN31:1;                    /**< \brief [31:31] Access E31able for Master TAG ID n (rw) */
} Ifx_PSI5_ACCEN0_Bits;

/** \brief  Access Enable Register 1 */
typedef struct _Ifx_PSI5_ACCEN1_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_PSI5_ACCEN1_Bits;

/** \brief  Channel Trigger Value Register */
typedef struct _Ifx_PSI5_CH_CTV_Bits
{
    unsigned int CTV:16;                    /**< \brief [15:0] Channel Trigger Value CTV (rw) */
    unsigned int CTC:16;                    /**< \brief [31:16] Channel Trigger Counter (rw) */
} Ifx_PSI5_CH_CTV_Bits;

/** \brief  Input and Output Control Register */
typedef struct _Ifx_PSI5_CH_IOCR_Bits
{
    unsigned int ALTI:2;                    /**< \brief [1:0] Alternate Input Select (rw) */
    unsigned int reserved_2:2;              /**< \brief \internal Reserved */
    unsigned int DEPTH:4;                   /**< \brief [7:4] Digital Glitch Filter Depth (rw) */
    unsigned int OIE:1;                     /**< \brief [8:8] Output Inverter Enable Channel x (rw) */
    unsigned int IIE:1;                     /**< \brief [9:9] Input Inverter Enable Channel x (rw) */
    unsigned int reserved_10:2;             /**< \brief \internal Reserved */
    unsigned int REG:1;                     /**< \brief [12:12] Rising Edge Glitch Flag for Channel x (rh) */
    unsigned int FEG:1;                     /**< \brief [13:13] Falling Edge Glitch Flag for Channel x (rh) */
    unsigned int CREG:1;                    /**< \brief [14:14] Clear Rising Edge Glitch Flag for Channel x (w) */
    unsigned int CFEG:1;                    /**< \brief [15:15] Clear Falling Edge Glitch Flag for Channel x (w) */
    unsigned int reserved_16:14;            /**< \brief \internal Reserved */
    unsigned int RXM:1;                     /**< \brief [30:30] Receive Monitor for Channel x (rh) */
    unsigned int TXM:1;                     /**< \brief [31:31] Transmit Monitor for Channel x (rh) */
} Ifx_PSI5_CH_IOCR_Bits;

/** \brief  Pulse Generation Control Register */
typedef struct _Ifx_PSI5_CH_PGC_Bits
{
    unsigned int PLEN:6;                    /**< \brief [5:0] Pulse Length (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int DEL:6;                     /**< \brief [13:8] Delay Length (rw) */
    unsigned int reserved_14:1;             /**< \brief \internal Reserved */
    unsigned int TBS:1;                     /**< \brief [15:15] Time Base Select (rw) */
    unsigned int ETB:3;                     /**< \brief [18:16] External Time Base Select (rw) */
    unsigned int PTE:1;                     /**< \brief [19:19] Periodic Trigger Enable (rw) */
    unsigned int ETS:3;                     /**< \brief [22:20] External Trigger Select (rw) */
    unsigned int ETE:1;                     /**< \brief [23:23] External Trigger Enable (rw) */
    unsigned int BYP:1;                     /**< \brief [24:24] Bypass Enable (rw) */
    unsigned int BOT:7;                     /**< \brief [31:25] Blank Out Time (rw) */
} Ifx_PSI5_CH_PGC_Bits;

/** \brief  Receiver Control Register A */
typedef struct _Ifx_PSI5_CH_RCRA_Bits
{
    unsigned int PDL0:5;                    /**< \brief [4:0] Pa0load Data Length (rw) */
    unsigned int PDL1:5;                    /**< \brief [9:5] Pa1load Data Length (rw) */
    unsigned int PDL2:5;                    /**< \brief [14:10] Pa2load Data Length (rw) */
    unsigned int PDL3:5;                    /**< \brief [19:15] Pa3load Data Length (rw) */
    unsigned int PDL4:5;                    /**< \brief [24:20] Pa4load Data Length (rw) */
    unsigned int PDL5:5;                    /**< \brief [29:25] Pa5load Data Length (rw) */
    unsigned int ASYN:1;                    /**< \brief [30:30] Asynchronous Mode (rw) */
    unsigned int AVBS:1;                    /**< \brief [31:31] Verbose Mode for Asynchronous Mode (rw) */
} Ifx_PSI5_CH_RCRA_Bits;

