Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_regdef.h
/** \brief  Interrupt Set Register B */
typedef struct _Ifx_PSI5_INTSETB_Bits
{
    unsigned int WSI0:1;                    /**< \brief [0:0] Set Interrupt Request Flag WSI0 (w) */
    unsigned int WSI1:1;                    /**< \brief [1:1] Set Interrupt Request Flag WSI1 (w) */
    unsigned int WSI2:1;                    /**< \brief [2:2] Set Interrupt Request Flag WSI2 (w) */
    unsigned int WSI3:1;                    /**< \brief [3:3] Set Interrupt Request Flag WSI3 (w) */
    unsigned int WSI4:1;                    /**< \brief [4:4] Set Interrupt Request Flag WSI4 (w) */
    unsigned int WSI5:1;                    /**< \brief [5:5] Set Interrupt Request Flag WSI5 (w) */
    unsigned int SDI0:1;                    /**< \brief [6:6] Set Interrupt Request Flag SDI0 (w) */
    unsigned int SDI1:1;                    /**< \brief [7:7] Set Interrupt Request Flag SDI1 (w) */
    unsigned int SDI2:1;                    /**< \brief [8:8] Set Interrupt Request Flag SDI2 (w) */
    unsigned int SDI3:1;                    /**< \brief [9:9] Set Interrupt Request Flag SDI3 (w) */
    unsigned int SDI4:1;                    /**< \brief [10:10] Set Interrupt Request Flag SDI4 (w) */
    unsigned int SDI5:1;                    /**< \brief [11:11] Set Interrupt Request Flag SDI5 (w) */
    unsigned int SOI0:1;                    /**< \brief [12:12] Set Interrupt Request Flag SOI0 (w) */
    unsigned int SOI1:1;                    /**< \brief [13:13] Set Interrupt Request Flag SOI1 (w) */
    unsigned int SOI2:1;                    /**< \brief [14:14] Set Interrupt Request Flag SOI2 (w) */
    unsigned int SOI3:1;                    /**< \brief [15:15] Set Interrupt Request Flag SOI3 (w) */
    unsigned int SOI4:1;                    /**< \brief [16:16] Set Interrupt Request Flag SOI4 (w) */
    unsigned int SOI5:1;                    /**< \brief [17:17] Set Interrupt Request Flag SOI5 (w) */
    unsigned int SCRI0:1;                   /**< \brief [18:18] Set Interrupt Request Flag SCRI0 (w) */
    unsigned int SCRI1:1;                   /**< \brief [19:19] Set Interrupt Request Flag SCRI1 (w) */
    unsigned int SCRI2:1;                   /**< \brief [20:20] Set Interrupt Request Flag SCRI2 (w) */
    unsigned int SCRI3:1;                   /**< \brief [21:21] Set Interrupt Request Flag SCRI3 (w) */
    unsigned int SCRI4:1;                   /**< \brief [22:22] Set Interrupt Request Flag SCRI4 (w) */
    unsigned int SCRI5:1;                   /**< \brief [23:23] Set Interrupt Request Flag SCRI5 (w) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5_INTSETB_Bits;

/** \brief  Interrupt Status Register A */
typedef struct _Ifx_PSI5_INTSTATA_Bits
{
    unsigned int RSI:1;                     /**< \brief [0:0] Receive Success Interrupt Request Flag (rh) */
    unsigned int RDI:1;                     /**< \brief [1:1] Receive Data Interrupt Request Flag (rh) */
    unsigned int RBI:1;                     /**< \brief [2:2] Receive Buffer Overflow Interrupt Request Flag (rh) */
    unsigned int TEI:1;                     /**< \brief [3:3] Time Slot Error Interrupt Request Flag (rh) */
    unsigned int NBI:1;                     /**< \brief [4:4] Number of Bits Wrong Request Flag (rh) */
    unsigned int MEI:1;                     /**< \brief [5:5] Error in Message Bits Flag (rh) */
    unsigned int CRCI:1;                    /**< \brief [6:6] CRC Error Request Flag (rh) */
    unsigned int FWI:1;                     /**< \brief [7:7] FIFO Warning Level Request Flag (rh) */
    unsigned int RUI:1;                     /**< \brief [8:8] Receive Memory Underrun Interrupt Request Flag (rh) */
    unsigned int RMI:1;                     /**< \brief [9:9] Receive Memory Overflow Flag (rh) */
    unsigned int TPI:1;                     /**< \brief [10:10] Transfer Preparation Interrupt Request Flag (rh) */
    unsigned int TPOI:1;                    /**< \brief [11:11] Transmit Preparation Overflow Interrupt Request Flag (rh) */
    unsigned int TSI:1;                     /**< \brief [12:12] Transfer Shift Interrupt Request Flag (rh) */
    unsigned int TSOI:1;                    /**< \brief [13:13] Transmit Shift Overflow Interrupt Request Flag (rh) */
    unsigned int TOI:1;                     /**< \brief [14:14] Transfer Output Interrupt Request Flag (rh) */
    unsigned int TOOI:1;                    /**< \brief [15:15] Transmit Shift Overflow Interrupt Request Flag (rh) */
    unsigned int NFI:1;                     /**< \brief [16:16] No Frame Received Interrupt Flag (rh) */
    unsigned int reserved_17:15;            /**< \brief \internal Reserved */
} Ifx_PSI5_INTSTATA_Bits;

/** \brief  Interrupt Status Register B */
typedef struct _Ifx_PSI5_INTSTATB_Bits
{
    unsigned int WSI0:1;                    /**< \brief [0:0] Wrong Serial Protocol Error Request Flag (rh) */
    unsigned int WSI1:1;                    /**< \brief [1:1] Wrong Serial Protocol Error Request Flag (rh) */
    unsigned int WSI2:1;                    /**< \brief [2:2] Wrong Serial Protocol Error Request Flag (rh) */
    unsigned int WSI3:1;                    /**< \brief [3:3] Wrong Serial Protocol Error Request Flag (rh) */
    unsigned int WSI4:1;                    /**< \brief [4:4] Wrong Serial Protocol Error Request Flag (rh) */
    unsigned int WSI5:1;                    /**< \brief [5:5] Wrong Serial Protocol Error Request Flag (rh) */
    unsigned int SDI0:1;                    /**< \brief [6:6] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SDI1:1;                    /**< \brief [7:7] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SDI2:1;                    /**< \brief [8:8] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SDI3:1;                    /**< \brief [9:9] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SDI4:1;                    /**< \brief [10:10] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SDI5:1;                    /**< \brief [11:11] Serial Data Receive Interrupt Request Flag (rh) */
    unsigned int SOI0:1;                    /**< \brief [12:12] Serial Data Buffer Overrun Interrupt Request Flag (rh) */
    unsigned int SOI1:1;                    /**< \brief [13:13] Serial Data Buffer Overrun Interrupt Request Flag (rh) */
    unsigned int SOI2:1;                    /**< \brief [14:14] Serial Data Buffer Overrun Interrupt Request Flag (rh) */
    unsigned int SOI3:1;                    /**< \brief [15:15] Serial Data Buffer Overrun Interrupt Request Flag (rh) */
    unsigned int SOI4:1;                    /**< \brief [16:16] Serial Data Buffer Overrun Interrupt Request Flag (rh) */
    unsigned int SOI5:1;                    /**< \brief [17:17] Serial Data Buffer Overrun Interrupt Request Flag (rh) */
    unsigned int SCRI0:1;                   /**< \brief [18:18] Serial Data CRC Error Request Flag (rh) */
    unsigned int SCRI1:1;                   /**< \brief [19:19] Serial Data CRC Error Request Flag (rh) */
    unsigned int SCRI2:1;                   /**< \brief [20:20] Serial Data CRC Error Request Flag (rh) */
    unsigned int SCRI3:1;                   /**< \brief [21:21] Serial Data CRC Error Request Flag (rh) */
    unsigned int SCRI4:1;                   /**< \brief [22:22] Serial Data CRC Error Request Flag (rh) */
    unsigned int SCRI5:1;                   /**< \brief [23:23] Serial Data CRC Error Request Flag (rh) */
    unsigned int reserved_24:8;             /**< \brief \internal Reserved */
} Ifx_PSI5_INTSTATB_Bits;

/** \brief  Kernel Reset Register 0 */
typedef struct _Ifx_PSI5_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_PSI5_KRST0_Bits;

/** \brief  Kernel Reset Register 1 */
typedef struct _Ifx_PSI5_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_PSI5_KRST1_Bits;

