Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_regdef.h
/** \brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_PSI5_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_PSI5_KRSTCLR_Bits;

/** \brief  MEI Overview Clear Register 0 */
typedef struct _Ifx_PSI5_MEICLR_Bits
{
    unsigned int MEI0:1;                    /**< \brief [0:0] Clear MEI Flag of Buffer 0 (w) */
    unsigned int MEI1:1;                    /**< \brief [1:1] Clear MEI Flag of Buffer 1 (w) */
    unsigned int MEI2:1;                    /**< \brief [2:2] Clear MEI Flag of Buffer 2 (w) */
    unsigned int MEI3:1;                    /**< \brief [3:3] Clear MEI Flag of Buffer 3 (w) */
    unsigned int MEI4:1;                    /**< \brief [4:4] Clear MEI Flag of Buffer 4 (w) */
    unsigned int MEI5:1;                    /**< \brief [5:5] Clear MEI Flag of Buffer 5 (w) */
    unsigned int MEI6:1;                    /**< \brief [6:6] Clear MEI Flag of Buffer 6 (w) */
    unsigned int MEI7:1;                    /**< \brief [7:7] Clear MEI Flag of Buffer 7 (w) */
    unsigned int MEI8:1;                    /**< \brief [8:8] Clear MEI Flag of Buffer 8 (w) */
    unsigned int MEI9:1;                    /**< \brief [9:9] Clear MEI Flag of Buffer 9 (w) */
    unsigned int MEI10:1;                   /**< \brief [10:10] Clear MEI Flag of Buffer 10 (w) */
    unsigned int MEI11:1;                   /**< \brief [11:11] Clear MEI Flag of Buffer 11 (w) */
    unsigned int MEI12:1;                   /**< \brief [12:12] Clear MEI Flag of Buffer 12 (w) */
    unsigned int MEI13:1;                   /**< \brief [13:13] Clear MEI Flag of Buffer 13 (w) */
    unsigned int MEI14:1;                   /**< \brief [14:14] Clear MEI Flag of Buffer 14 (w) */
    unsigned int MEI15:1;                   /**< \brief [15:15] Clear MEI Flag of Buffer 15 (w) */
    unsigned int MEI16:1;                   /**< \brief [16:16] Clear MEI Flag of Buffer 16 (w) */
    unsigned int MEI17:1;                   /**< \brief [17:17] Clear MEI Flag of Buffer 17 (w) */
    unsigned int MEI18:1;                   /**< \brief [18:18] Clear MEI Flag of Buffer 18 (w) */
    unsigned int MEI19:1;                   /**< \brief [19:19] Clear MEI Flag of Buffer 19 (w) */
    unsigned int MEI20:1;                   /**< \brief [20:20] Clear MEI Flag of Buffer 20 (w) */
    unsigned int MEI21:1;                   /**< \brief [21:21] Clear MEI Flag of Buffer 21 (w) */
    unsigned int MEI22:1;                   /**< \brief [22:22] Clear MEI Flag of Buffer 22 (w) */
    unsigned int MEI23:1;                   /**< \brief [23:23] Clear MEI Flag of Buffer 23 (w) */
    unsigned int MEI24:1;                   /**< \brief [24:24] Clear MEI Flag of Buffer 24 (w) */
    unsigned int MEI25:1;                   /**< \brief [25:25] Clear MEI Flag of Buffer 25 (w) */
    unsigned int MEI26:1;                   /**< \brief [26:26] Clear MEI Flag of Buffer 26 (w) */
    unsigned int MEI27:1;                   /**< \brief [27:27] Clear MEI Flag of Buffer 27 (w) */
    unsigned int MEI28:1;                   /**< \brief [28:28] Clear MEI Flag of Buffer 28 (w) */
    unsigned int MEI29:1;                   /**< \brief [29:29] Clear MEI Flag of Buffer 29 (w) */
    unsigned int MEI30:1;                   /**< \brief [30:30] Clear MEI Flag of Buffer 30 (w) */
    unsigned int MEI31:1;                   /**< \brief [31:31] Clear MEI Flag of Buffer 31 (w) */
} Ifx_PSI5_MEICLR_Bits;

/** \brief  MEI Overview Register */
typedef struct _Ifx_PSI5_MEIOV_Bits
{
    unsigned int MEI0:1;                    /**< \brief [0:0] MEI Flag of Buffer 0 (rh) */
    unsigned int MEI1:1;                    /**< \brief [1:1] MEI Flag of Buffer 1 (rh) */
    unsigned int MEI2:1;                    /**< \brief [2:2] MEI Flag of Buffer 2 (rh) */
    unsigned int MEI3:1;                    /**< \brief [3:3] MEI Flag of Buffer 3 (rh) */
    unsigned int MEI4:1;                    /**< \brief [4:4] MEI Flag of Buffer 4 (rh) */
    unsigned int MEI5:1;                    /**< \brief [5:5] MEI Flag of Buffer 5 (rh) */
    unsigned int MEI6:1;                    /**< \brief [6:6] MEI Flag of Buffer 6 (rh) */
    unsigned int MEI7:1;                    /**< \brief [7:7] MEI Flag of Buffer 7 (rh) */
    unsigned int MEI8:1;                    /**< \brief [8:8] MEI Flag of Buffer 8 (rh) */
    unsigned int MEI9:1;                    /**< \brief [9:9] MEI Flag of Buffer 9 (rh) */
    unsigned int MEI10:1;                   /**< \brief [10:10] MEI Flag of Buffer 10 (rh) */
    unsigned int MEI11:1;                   /**< \brief [11:11] MEI Flag of Buffer 11 (rh) */
    unsigned int MEI12:1;                   /**< \brief [12:12] MEI Flag of Buffer 12 (rh) */
    unsigned int MEI13:1;                   /**< \brief [13:13] MEI Flag of Buffer 13 (rh) */
    unsigned int MEI14:1;                   /**< \brief [14:14] MEI Flag of Buffer 14 (rh) */
    unsigned int MEI15:1;                   /**< \brief [15:15] MEI Flag of Buffer 15 (rh) */
    unsigned int MEI16:1;                   /**< \brief [16:16] MEI Flag of Buffer 16 (rh) */
    unsigned int MEI17:1;                   /**< \brief [17:17] MEI Flag of Buffer 17 (rh) */
    unsigned int MEI18:1;                   /**< \brief [18:18] MEI Flag of Buffer 18 (rh) */
    unsigned int MEI19:1;                   /**< \brief [19:19] MEI Flag of Buffer 19 (rh) */
    unsigned int MEI20:1;                   /**< \brief [20:20] MEI Flag of Buffer 20 (rh) */
    unsigned int MEI21:1;                   /**< \brief [21:21] MEI Flag of Buffer 21 (rh) */
    unsigned int MEI22:1;                   /**< \brief [22:22] MEI Flag of Buffer 22 (rh) */
    unsigned int MEI23:1;                   /**< \brief [23:23] MEI Flag of Buffer 23 (rh) */
    unsigned int MEI24:1;                   /**< \brief [24:24] MEI Flag of Buffer 24 (rh) */
    unsigned int MEI25:1;                   /**< \brief [25:25] MEI Flag of Buffer 25 (rh) */
    unsigned int MEI26:1;                   /**< \brief [26:26] MEI Flag of Buffer 26 (rh) */
    unsigned int MEI27:1;                   /**< \brief [27:27] MEI Flag of Buffer 27 (rh) */
    unsigned int MEI28:1;                   /**< \brief [28:28] MEI Flag of Buffer 28 (rh) */
    unsigned int MEI29:1;                   /**< \brief [29:29] MEI Flag of Buffer 29 (rh) */
    unsigned int MEI30:1;                   /**< \brief [30:30] MEI Flag of Buffer 30 (rh) */
    unsigned int MEI31:1;                   /**< \brief [31:31] MEI Flag of Buffer 31 (rh) */
} Ifx_PSI5_MEIOV_Bits;

/** \brief  MEI Overview Set Register 0 */
typedef struct _Ifx_PSI5_MEISET_Bits
{
    unsigned int MEI0:1;                    /**< \brief [0:0] Set MEI Flag of Buffer 0 (w) */
    unsigned int MEI1:1;                    /**< \brief [1:1] Set MEI Flag of Buffer 1 (w) */
    unsigned int MEI2:1;                    /**< \brief [2:2] Set MEI Flag of Buffer 2 (w) */
    unsigned int MEI3:1;                    /**< \brief [3:3] Set MEI Flag of Buffer 3 (w) */
    unsigned int MEI4:1;                    /**< \brief [4:4] Set MEI Flag of Buffer 4 (w) */
    unsigned int MEI5:1;                    /**< \brief [5:5] Set MEI Flag of Buffer 5 (w) */
    unsigned int MEI6:1;                    /**< \brief [6:6] Set MEI Flag of Buffer 6 (w) */
    unsigned int MEI7:1;                    /**< \brief [7:7] Set MEI Flag of Buffer 7 (w) */
    unsigned int MEI8:1;                    /**< \brief [8:8] Set MEI Flag of Buffer 8 (w) */
    unsigned int MEI9:1;                    /**< \brief [9:9] Set MEI Flag of Buffer 9 (w) */
    unsigned int MEI10:1;                   /**< \brief [10:10] Set MEI Flag of Buffer 10 (w) */
    unsigned int MEI11:1;                   /**< \brief [11:11] Set MEI Flag of Buffer 11 (w) */
    unsigned int MEI12:1;                   /**< \brief [12:12] Set MEI Flag of Buffer 12 (w) */
    unsigned int MEI13:1;                   /**< \brief [13:13] Set MEI Flag of Buffer 13 (w) */
    unsigned int MEI14:1;                   /**< \brief [14:14] Set MEI Flag of Buffer 14 (w) */
    unsigned int MEI15:1;                   /**< \brief [15:15] Set MEI Flag of Buffer 15 (w) */
    unsigned int MEI16:1;                   /**< \brief [16:16] Set MEI Flag of Buffer 16 (w) */
    unsigned int MEI17:1;                   /**< \brief [17:17] Set MEI Flag of Buffer 17 (w) */
    unsigned int MEI18:1;                   /**< \brief [18:18] Set MEI Flag of Buffer 18 (w) */
    unsigned int MEI19:1;                   /**< \brief [19:19] Set MEI Flag of Buffer 19 (w) */
    unsigned int MEI20:1;                   /**< \brief [20:20] Set MEI Flag of Buffer 20 (w) */
    unsigned int MEI21:1;                   /**< \brief [21:21] Set MEI Flag of Buffer 21 (w) */
    unsigned int MEI22:1;                   /**< \brief [22:22] Set MEI Flag of Buffer 22 (w) */
    unsigned int MEI23:1;                   /**< \brief [23:23] Set MEI Flag of Buffer 23 (w) */
    unsigned int MEI24:1;                   /**< \brief [24:24] Set MEI Flag of Buffer 24 (w) */
    unsigned int MEI25:1;                   /**< \brief [25:25] Set MEI Flag of Buffer 25 (w) */
    unsigned int MEI26:1;                   /**< \brief [26:26] Set MEI Flag of Buffer 26 (w) */
    unsigned int MEI27:1;                   /**< \brief [27:27] Set MEI Flag of Buffer 27 (w) */
    unsigned int MEI28:1;                   /**< \brief [28:28] Set MEI Flag of Buffer 28 (w) */
    unsigned int MEI29:1;                   /**< \brief [29:29] Set MEI Flag of Buffer 29 (w) */
    unsigned int MEI30:1;                   /**< \brief [30:30] Set MEI Flag of Buffer 30 (w) */
    unsigned int MEI31:1;                   /**< \brief [31:31] Set MEI Flag of Buffer 31 (w) */
} Ifx_PSI5_MEISET_Bits;

/** \brief  NBI Overview Clear Register 0 */
typedef struct _Ifx_PSI5_NBICLR_Bits
{
    unsigned int NBI0:1;                    /**< \brief [0:0] Clear NBI Flag of Buffer 0 (w) */
    unsigned int NBI1:1;                    /**< \brief [1:1] Clear NBI Flag of Buffer 1 (w) */
    unsigned int NBI2:1;                    /**< \brief [2:2] Clear NBI Flag of Buffer 2 (w) */
    unsigned int NBI3:1;                    /**< \brief [3:3] Clear NBI Flag of Buffer 3 (w) */
    unsigned int NBI4:1;                    /**< \brief [4:4] Clear NBI Flag of Buffer 4 (w) */
    unsigned int NBI5:1;                    /**< \brief [5:5] Clear NBI Flag of Buffer 5 (w) */
    unsigned int NBI6:1;                    /**< \brief [6:6] Clear NBI Flag of Buffer 6 (w) */
    unsigned int NBI7:1;                    /**< \brief [7:7] Clear NBI Flag of Buffer 7 (w) */
    unsigned int NBI8:1;                    /**< \brief [8:8] Clear NBI Flag of Buffer 8 (w) */
    unsigned int NBI9:1;                    /**< \brief [9:9] Clear NBI Flag of Buffer 9 (w) */
    unsigned int NBI10:1;                   /**< \brief [10:10] Clear NBI Flag of Buffer 10 (w) */
    unsigned int NBI11:1;                   /**< \brief [11:11] Clear NBI Flag of Buffer 11 (w) */
    unsigned int NBI12:1;                   /**< \brief [12:12] Clear NBI Flag of Buffer 12 (w) */
    unsigned int NBI13:1;                   /**< \brief [13:13] Clear NBI Flag of Buffer 13 (w) */
    unsigned int NBI14:1;                   /**< \brief [14:14] Clear NBI Flag of Buffer 14 (w) */
    unsigned int NBI15:1;                   /**< \brief [15:15] Clear NBI Flag of Buffer 15 (w) */
    unsigned int NBI16:1;                   /**< \brief [16:16] Clear NBI Flag of Buffer 16 (w) */
    unsigned int NBI17:1;                   /**< \brief [17:17] Clear NBI Flag of Buffer 17 (w) */
    unsigned int NBI18:1;                   /**< \brief [18:18] Clear NBI Flag of Buffer 18 (w) */
    unsigned int NBI19:1;                   /**< \brief [19:19] Clear NBI Flag of Buffer 19 (w) */
    unsigned int NBI20:1;                   /**< \brief [20:20] Clear NBI Flag of Buffer 20 (w) */
    unsigned int NBI21:1;                   /**< \brief [21:21] Clear NBI Flag of Buffer 21 (w) */
    unsigned int NBI22:1;                   /**< \brief [22:22] Clear NBI Flag of Buffer 22 (w) */
    unsigned int NBI23:1;                   /**< \brief [23:23] Clear NBI Flag of Buffer 23 (w) */
    unsigned int NBI24:1;                   /**< \brief [24:24] Clear NBI Flag of Buffer 24 (w) */
    unsigned int NBI25:1;                   /**< \brief [25:25] Clear NBI Flag of Buffer 25 (w) */
    unsigned int NBI26:1;                   /**< \brief [26:26] Clear NBI Flag of Buffer 26 (w) */
    unsigned int NBI27:1;                   /**< \brief [27:27] Clear NBI Flag of Buffer 27 (w) */
    unsigned int NBI28:1;                   /**< \brief [28:28] Clear NBI Flag of Buffer 28 (w) */
    unsigned int NBI29:1;                   /**< \brief [29:29] Clear NBI Flag of Buffer 29 (w) */
    unsigned int NBI30:1;                   /**< \brief [30:30] Clear NBI Flag of Buffer 30 (w) */
    unsigned int NBI31:1;                   /**< \brief [31:31] Clear NBI Flag of Buffer 31 (w) */
} Ifx_PSI5_NBICLR_Bits;

/** \brief  NBI Overview Register */
typedef struct _Ifx_PSI5_NBIOV_Bits
{
    unsigned int NBI0:1;                    /**< \brief [0:0] NBI Flag of Buffer 0 (rh) */
    unsigned int NBI1:1;                    /**< \brief [1:1] NBI Flag of Buffer 1 (rh) */
    unsigned int NBI2:1;                    /**< \brief [2:2] NBI Flag of Buffer 2 (rh) */
    unsigned int NBI3:1;                    /**< \brief [3:3] NBI Flag of Buffer 3 (rh) */
    unsigned int NBI4:1;                    /**< \brief [4:4] NBI Flag of Buffer 4 (rh) */
    unsigned int NBI5:1;                    /**< \brief [5:5] NBI Flag of Buffer 5 (rh) */
    unsigned int NBI6:1;                    /**< \brief [6:6] NBI Flag of Buffer 6 (rh) */
    unsigned int NBI7:1;                    /**< \brief [7:7] NBI Flag of Buffer 7 (rh) */
    unsigned int NBI8:1;                    /**< \brief [8:8] NBI Flag of Buffer 8 (rh) */
    unsigned int NBI9:1;                    /**< \brief [9:9] NBI Flag of Buffer 9 (rh) */
    unsigned int NBI10:1;                   /**< \brief [10:10] NBI Flag of Buffer 10 (rh) */
    unsigned int NBI11:1;                   /**< \brief [11:11] NBI Flag of Buffer 11 (rh) */
    unsigned int NBI12:1;                   /**< \brief [12:12] NBI Flag of Buffer 12 (rh) */
    unsigned int NBI13:1;                   /**< \brief [13:13] NBI Flag of Buffer 13 (rh) */
    unsigned int NBI14:1;                   /**< \brief [14:14] NBI Flag of Buffer 14 (rh) */
    unsigned int NBI15:1;                   /**< \brief [15:15] NBI Flag of Buffer 15 (rh) */
    unsigned int NBI16:1;                   /**< \brief [16:16] NBI Flag of Buffer 16 (rh) */
    unsigned int NBI17:1;                   /**< \brief [17:17] NBI Flag of Buffer 17 (rh) */
    unsigned int NBI18:1;                   /**< \brief [18:18] NBI Flag of Buffer 18 (rh) */
    unsigned int NBI19:1;                   /**< \brief [19:19] NBI Flag of Buffer 19 (rh) */
    unsigned int NBI20:1;                   /**< \brief [20:20] NBI Flag of Buffer 20 (rh) */
    unsigned int NBI21:1;                   /**< \brief [21:21] NBI Flag of Buffer 21 (rh) */
    unsigned int NBI22:1;                   /**< \brief [22:22] NBI Flag of Buffer 22 (rh) */
    unsigned int NBI23:1;                   /**< \brief [23:23] NBI Flag of Buffer 23 (rh) */
    unsigned int NBI24:1;                   /**< \brief [24:24] NBI Flag of Buffer 24 (rh) */
    unsigned int NBI25:1;                   /**< \brief [25:25] NBI Flag of Buffer 25 (rh) */
    unsigned int NBI26:1;                   /**< \brief [26:26] NBI Flag of Buffer 26 (rh) */
    unsigned int NBI27:1;                   /**< \brief [27:27] NBI Flag of Buffer 27 (rh) */
    unsigned int NBI28:1;                   /**< \brief [28:28] NBI Flag of Buffer 28 (rh) */
    unsigned int NBI29:1;                   /**< \brief [29:29] NBI Flag of Buffer 29 (rh) */
    unsigned int NBI30:1;                   /**< \brief [30:30] NBI Flag of Buffer 30 (rh) */
    unsigned int NBI31:1;                   /**< \brief [31:31] NBI Flag of Buffer 31 (rh) */
} Ifx_PSI5_NBIOV_Bits;

/** \brief  NBI Overview Set Register 0 */
typedef struct _Ifx_PSI5_NBISET_Bits
{
    unsigned int NBI0:1;                    /**< \brief [0:0] Set NBI Flag of Buffer 0 (w) */
    unsigned int NBI1:1;                    /**< \brief [1:1] Set NBI Flag of Buffer 1 (w) */
    unsigned int NBI2:1;                    /**< \brief [2:2] Set NBI Flag of Buffer 2 (w) */
    unsigned int NBI3:1;                    /**< \brief [3:3] Set NBI Flag of Buffer 3 (w) */
    unsigned int NBI4:1;                    /**< \brief [4:4] Set NBI Flag of Buffer 4 (w) */
    unsigned int NBI5:1;                    /**< \brief [5:5] Set NBI Flag of Buffer 5 (w) */
    unsigned int NBI6:1;                    /**< \brief [6:6] Set NBI Flag of Buffer 6 (w) */
    unsigned int NBI7:1;                    /**< \brief [7:7] Set NBI Flag of Buffer 7 (w) */
    unsigned int NBI8:1;                    /**< \brief [8:8] Set NBI Flag of Buffer 8 (w) */
    unsigned int NBI9:1;                    /**< \brief [9:9] Set NBI Flag of Buffer 9 (w) */
    unsigned int NBI10:1;                   /**< \brief [10:10] Set NBI Flag of Buffer 10 (w) */
    unsigned int NBI11:1;                   /**< \brief [11:11] Set NBI Flag of Buffer 11 (w) */
    unsigned int NBI12:1;                   /**< \brief [12:12] Set NBI Flag of Buffer 12 (w) */
    unsigned int NBI13:1;                   /**< \brief [13:13] Set NBI Flag of Buffer 13 (w) */
    unsigned int NBI14:1;                   /**< \brief [14:14] Set NBI Flag of Buffer 14 (w) */
    unsigned int NBI15:1;                   /**< \brief [15:15] Set NBI Flag of Buffer 15 (w) */
    unsigned int NBI16:1;                   /**< \brief [16:16] Set NBI Flag of Buffer 16 (w) */
    unsigned int NBI17:1;                   /**< \brief [17:17] Set NBI Flag of Buffer 17 (w) */
    unsigned int NBI18:1;                   /**< \brief [18:18] Set NBI Flag of Buffer 18 (w) */
    unsigned int NBI19:1;                   /**< \brief [19:19] Set NBI Flag of Buffer 19 (w) */
    unsigned int NBI20:1;                   /**< \brief [20:20] Set NBI Flag of Buffer 20 (w) */
    unsigned int NBI21:1;                   /**< \brief [21:21] Set NBI Flag of Buffer 21 (w) */
    unsigned int NBI22:1;                   /**< \brief [22:22] Set NBI Flag of Buffer 22 (w) */
    unsigned int NBI23:1;                   /**< \brief [23:23] Set NBI Flag of Buffer 23 (w) */
    unsigned int NBI24:1;                   /**< \brief [24:24] Set NBI Flag of Buffer 24 (w) */
    unsigned int NBI25:1;                   /**< \brief [25:25] Set NBI Flag of Buffer 25 (w) */
    unsigned int NBI26:1;                   /**< \brief [26:26] Set NBI Flag of Buffer 26 (w) */
    unsigned int NBI27:1;                   /**< \brief [27:27] Set NBI Flag of Buffer 27 (w) */
    unsigned int NBI28:1;                   /**< \brief [28:28] Set NBI Flag of Buffer 28 (w) */
    unsigned int NBI29:1;                   /**< \brief [29:29] Set NBI Flag of Buffer 29 (w) */
    unsigned int NBI30:1;                   /**< \brief [30:30] Set NBI Flag of Buffer 30 (w) */
    unsigned int NBI31:1;                   /**< \brief [31:31] Set NBI Flag of Buffer 31 (w) */
} Ifx_PSI5_NBISET_Bits;

/** \brief  NFI Overview Clear Register 0 */
typedef struct _Ifx_PSI5_NFICLR_Bits
{
    unsigned int NFI0:1;                    /**< \brief [0:0] Clear NFI Flag of Buffer 0 (w) */
    unsigned int NFI1:1;                    /**< \brief [1:1] Clear NFI Flag of Buffer 1 (w) */
    unsigned int NFI2:1;                    /**< \brief [2:2] Clear NFI Flag of Buffer 2 (w) */
    unsigned int NFI3:1;                    /**< \brief [3:3] Clear NFI Flag of Buffer 3 (w) */
    unsigned int NFI4:1;                    /**< \brief [4:4] Clear NFI Flag of Buffer 4 (w) */
    unsigned int NFI5:1;                    /**< \brief [5:5] Clear NFI Flag of Buffer 5 (w) */
    unsigned int NFI6:1;                    /**< \brief [6:6] Clear NFI Flag of Buffer 6 (w) */
    unsigned int NFI7:1;                    /**< \brief [7:7] Clear NFI Flag of Buffer 7 (w) */
    unsigned int NFI8:1;                    /**< \brief [8:8] Clear NFI Flag of Buffer 8 (w) */
    unsigned int NFI9:1;                    /**< \brief [9:9] Clear NFI Flag of Buffer 9 (w) */
    unsigned int NFI10:1;                   /**< \brief [10:10] Clear NFI Flag of Buffer 10 (w) */
    unsigned int NFI11:1;                   /**< \brief [11:11] Clear NFI Flag of Buffer 11 (w) */
    unsigned int NFI12:1;                   /**< \brief [12:12] Clear NFI Flag of Buffer 12 (w) */
    unsigned int NFI13:1;                   /**< \brief [13:13] Clear NFI Flag of Buffer 13 (w) */
    unsigned int NFI14:1;                   /**< \brief [14:14] Clear NFI Flag of Buffer 14 (w) */
    unsigned int NFI15:1;                   /**< \brief [15:15] Clear NFI Flag of Buffer 15 (w) */
    unsigned int NFI16:1;                   /**< \brief [16:16] Clear NFI Flag of Buffer 16 (w) */
    unsigned int NFI17:1;                   /**< \brief [17:17] Clear NFI Flag of Buffer 17 (w) */
    unsigned int NFI18:1;                   /**< \brief [18:18] Clear NFI Flag of Buffer 18 (w) */
    unsigned int NFI19:1;                   /**< \brief [19:19] Clear NFI Flag of Buffer 19 (w) */
    unsigned int NFI20:1;                   /**< \brief [20:20] Clear NFI Flag of Buffer 20 (w) */
    unsigned int NFI21:1;                   /**< \brief [21:21] Clear NFI Flag of Buffer 21 (w) */
    unsigned int NFI22:1;                   /**< \brief [22:22] Clear NFI Flag of Buffer 22 (w) */
    unsigned int NFI23:1;                   /**< \brief [23:23] Clear NFI Flag of Buffer 23 (w) */
    unsigned int NFI24:1;                   /**< \brief [24:24] Clear NFI Flag of Buffer 24 (w) */
    unsigned int NFI25:1;                   /**< \brief [25:25] Clear NFI Flag of Buffer 25 (w) */
    unsigned int NFI26:1;                   /**< \brief [26:26] Clear NFI Flag of Buffer 26 (w) */
    unsigned int NFI27:1;                   /**< \brief [27:27] Clear NFI Flag of Buffer 27 (w) */
    unsigned int NFI28:1;                   /**< \brief [28:28] Clear NFI Flag of Buffer 28 (w) */
    unsigned int NFI29:1;                   /**< \brief [29:29] Clear NFI Flag of Buffer 29 (w) */
    unsigned int NFI30:1;                   /**< \brief [30:30] Clear NFI Flag of Buffer 30 (w) */
    unsigned int NFI31:1;                   /**< \brief [31:31] Clear NFI Flag of Buffer 31 (w) */
} Ifx_PSI5_NFICLR_Bits;

