Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_regdef.h
/** \brief  RDI Overview Set Register 0 */
typedef struct _Ifx_PSI5_RDISET_Bits
{
    unsigned int RDI0:1;                    /**< \brief [0:0] Set RDI Flag of Buffer 0 (w) */
    unsigned int RDI1:1;                    /**< \brief [1:1] Set RDI Flag of Buffer 1 (w) */
    unsigned int RDI2:1;                    /**< \brief [2:2] Set RDI Flag of Buffer 2 (w) */
    unsigned int RDI3:1;                    /**< \brief [3:3] Set RDI Flag of Buffer 3 (w) */
    unsigned int RDI4:1;                    /**< \brief [4:4] Set RDI Flag of Buffer 4 (w) */
    unsigned int RDI5:1;                    /**< \brief [5:5] Set RDI Flag of Buffer 5 (w) */
    unsigned int RDI6:1;                    /**< \brief [6:6] Set RDI Flag of Buffer 6 (w) */
    unsigned int RDI7:1;                    /**< \brief [7:7] Set RDI Flag of Buffer 7 (w) */
    unsigned int RDI8:1;                    /**< \brief [8:8] Set RDI Flag of Buffer 8 (w) */
    unsigned int RDI9:1;                    /**< \brief [9:9] Set RDI Flag of Buffer 9 (w) */
    unsigned int RDI10:1;                   /**< \brief [10:10] Set RDI Flag of Buffer 10 (w) */
    unsigned int RDI11:1;                   /**< \brief [11:11] Set RDI Flag of Buffer 11 (w) */
    unsigned int RDI12:1;                   /**< \brief [12:12] Set RDI Flag of Buffer 12 (w) */
    unsigned int RDI13:1;                   /**< \brief [13:13] Set RDI Flag of Buffer 13 (w) */
    unsigned int RDI14:1;                   /**< \brief [14:14] Set RDI Flag of Buffer 14 (w) */
    unsigned int RDI15:1;                   /**< \brief [15:15] Set RDI Flag of Buffer 15 (w) */
    unsigned int RDI16:1;                   /**< \brief [16:16] Set RDI Flag of Buffer 16 (w) */
    unsigned int RDI17:1;                   /**< \brief [17:17] Set RDI Flag of Buffer 17 (w) */
    unsigned int RDI18:1;                   /**< \brief [18:18] Set RDI Flag of Buffer 18 (w) */
    unsigned int RDI19:1;                   /**< \brief [19:19] Set RDI Flag of Buffer 19 (w) */
    unsigned int RDI20:1;                   /**< \brief [20:20] Set RDI Flag of Buffer 20 (w) */
    unsigned int RDI21:1;                   /**< \brief [21:21] Set RDI Flag of Buffer 21 (w) */
    unsigned int RDI22:1;                   /**< \brief [22:22] Set RDI Flag of Buffer 22 (w) */
    unsigned int RDI23:1;                   /**< \brief [23:23] Set RDI Flag of Buffer 23 (w) */
    unsigned int RDI24:1;                   /**< \brief [24:24] Set RDI Flag of Buffer 24 (w) */
    unsigned int RDI25:1;                   /**< \brief [25:25] Set RDI Flag of Buffer 25 (w) */
    unsigned int RDI26:1;                   /**< \brief [26:26] Set RDI Flag of Buffer 26 (w) */
    unsigned int RDI27:1;                   /**< \brief [27:27] Set RDI Flag of Buffer 27 (w) */
    unsigned int RDI28:1;                   /**< \brief [28:28] Set RDI Flag of Buffer 28 (w) */
    unsigned int RDI29:1;                   /**< \brief [29:29] Set RDI Flag of Buffer 29 (w) */
    unsigned int RDI30:1;                   /**< \brief [30:30] Set RDI Flag of Buffer 30 (w) */
    unsigned int RDI31:1;                   /**< \brief [31:31] Set RDI Flag of Buffer 31 (w) */
} Ifx_PSI5_RDISET_Bits;

/** \brief  Receive Data Memor0 High 0y */
typedef struct _Ifx_PSI5_RDM_H_Bits
{
    unsigned int TS:24;                     /**< \brief [23:0] Time Stamp (rh) */
    unsigned int SC:3;                      /**< \brief [26:24] Slot Counter (rh) */
    unsigned int TEI:1;                     /**< \brief [27:27] Time Slot Error Flag (rh) */
    unsigned int NBI:1;                     /**< \brief [28:28] Number of bits Error Flag (rh) */
    unsigned int MEI:1;                     /**< \brief [29:29] Error in Messaging Bits Flag (rh) */
    unsigned int NFI:1;                     /**< \brief [30:30] No Frame Received Flag (rh) */
    unsigned int RMI:1;                     /**< \brief [31:31] Receive Memory Overflow Flag (rh) */
} Ifx_PSI5_RDM_H_Bits;

/** \brief  Receive Data Memor0 Low 0y */
typedef struct _Ifx_PSI5_RDM_L_Bits
{
    unsigned int CRCI:1;                    /**< \brief [0:0] CRC Error Flag (rh) */
    unsigned int CRC:3;                     /**< \brief [3:1] CRC (rh) */
    unsigned int RD:28;                     /**< \brief [31:4] RD (rh) */
} Ifx_PSI5_RDM_L_Bits;

/** \brief  Receive FIFO Control Register */
typedef struct _Ifx_PSI5_RFC_Bits
{
    unsigned int REP:6;                     /**< \brief [5:0] FIFO Read Pointer (r) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int WRP:6;                     /**< \brief [13:8] FIFO/Ring Buffer Write Pointer (r) */
    unsigned int reserved_14:2;             /**< \brief \internal Reserved */
    unsigned int FWL:5;                     /**< \brief [20:16] FIFO Warning Level (rw) */
    unsigned int reserved_21:8;             /**< \brief \internal Reserved */
    unsigned int WRAP:1;                    /**< \brief [29:29] Write Pointer WRAP Indicator (r) */
    unsigned int FRQ:1;                     /**< \brief [30:30] Flush Request (r) */
    unsigned int FLU:1;                     /**< \brief [31:31] Flush (w) */
} Ifx_PSI5_RFC_Bits;

/** \brief  RMI Overview Clear Register 0 */
typedef struct _Ifx_PSI5_RMICLR_Bits
{
    unsigned int RMI0:1;                    /**< \brief [0:0] Clear RMI Flag of Buffer 0 (w) */
    unsigned int RMI1:1;                    /**< \brief [1:1] Clear RMI Flag of Buffer 1 (w) */
    unsigned int RMI2:1;                    /**< \brief [2:2] Clear RMI Flag of Buffer 2 (w) */
    unsigned int RMI3:1;                    /**< \brief [3:3] Clear RMI Flag of Buffer 3 (w) */
    unsigned int RMI4:1;                    /**< \brief [4:4] Clear RMI Flag of Buffer 4 (w) */
    unsigned int RMI5:1;                    /**< \brief [5:5] Clear RMI Flag of Buffer 5 (w) */
    unsigned int RMI6:1;                    /**< \brief [6:6] Clear RMI Flag of Buffer 6 (w) */
    unsigned int RMI7:1;                    /**< \brief [7:7] Clear RMI Flag of Buffer 7 (w) */
    unsigned int RMI8:1;                    /**< \brief [8:8] Clear RMI Flag of Buffer 8 (w) */
    unsigned int RMI9:1;                    /**< \brief [9:9] Clear RMI Flag of Buffer 9 (w) */
    unsigned int RMI10:1;                   /**< \brief [10:10] Clear RMI Flag of Buffer 10 (w) */
    unsigned int RMI11:1;                   /**< \brief [11:11] Clear RMI Flag of Buffer 11 (w) */
    unsigned int RMI12:1;                   /**< \brief [12:12] Clear RMI Flag of Buffer 12 (w) */
    unsigned int RMI13:1;                   /**< \brief [13:13] Clear RMI Flag of Buffer 13 (w) */
    unsigned int RMI14:1;                   /**< \brief [14:14] Clear RMI Flag of Buffer 14 (w) */
    unsigned int RMI15:1;                   /**< \brief [15:15] Clear RMI Flag of Buffer 15 (w) */
    unsigned int RMI16:1;                   /**< \brief [16:16] Clear RMI Flag of Buffer 16 (w) */
    unsigned int RMI17:1;                   /**< \brief [17:17] Clear RMI Flag of Buffer 17 (w) */
    unsigned int RMI18:1;                   /**< \brief [18:18] Clear RMI Flag of Buffer 18 (w) */
    unsigned int RMI19:1;                   /**< \brief [19:19] Clear RMI Flag of Buffer 19 (w) */
    unsigned int RMI20:1;                   /**< \brief [20:20] Clear RMI Flag of Buffer 20 (w) */
    unsigned int RMI21:1;                   /**< \brief [21:21] Clear RMI Flag of Buffer 21 (w) */
    unsigned int RMI22:1;                   /**< \brief [22:22] Clear RMI Flag of Buffer 22 (w) */
    unsigned int RMI23:1;                   /**< \brief [23:23] Clear RMI Flag of Buffer 23 (w) */
    unsigned int RMI24:1;                   /**< \brief [24:24] Clear RMI Flag of Buffer 24 (w) */
    unsigned int RMI25:1;                   /**< \brief [25:25] Clear RMI Flag of Buffer 25 (w) */
    unsigned int RMI26:1;                   /**< \brief [26:26] Clear RMI Flag of Buffer 26 (w) */
    unsigned int RMI27:1;                   /**< \brief [27:27] Clear RMI Flag of Buffer 27 (w) */
    unsigned int RMI28:1;                   /**< \brief [28:28] Clear RMI Flag of Buffer 28 (w) */
    unsigned int RMI29:1;                   /**< \brief [29:29] Clear RMI Flag of Buffer 29 (w) */
    unsigned int RMI30:1;                   /**< \brief [30:30] Clear RMI Flag of Buffer 30 (w) */
    unsigned int RMI31:1;                   /**< \brief [31:31] Clear RMI Flag of Buffer 31 (w) */
} Ifx_PSI5_RMICLR_Bits;

/** \brief  RMI Overview Register */
typedef struct _Ifx_PSI5_RMIOV_Bits
{
    unsigned int RMI0:1;                    /**< \brief [0:0] RMI Flag of Buffer 0 (rh) */
    unsigned int RMI1:1;                    /**< \brief [1:1] RMI Flag of Buffer 1 (rh) */
    unsigned int RMI2:1;                    /**< \brief [2:2] RMI Flag of Buffer 2 (rh) */
    unsigned int RMI3:1;                    /**< \brief [3:3] RMI Flag of Buffer 3 (rh) */
    unsigned int RMI4:1;                    /**< \brief [4:4] RMI Flag of Buffer 4 (rh) */
    unsigned int RMI5:1;                    /**< \brief [5:5] RMI Flag of Buffer 5 (rh) */
    unsigned int RMI6:1;                    /**< \brief [6:6] RMI Flag of Buffer 6 (rh) */
    unsigned int RMI7:1;                    /**< \brief [7:7] RMI Flag of Buffer 7 (rh) */
    unsigned int RMI8:1;                    /**< \brief [8:8] RMI Flag of Buffer 8 (rh) */
    unsigned int RMI9:1;                    /**< \brief [9:9] RMI Flag of Buffer 9 (rh) */
    unsigned int RMI10:1;                   /**< \brief [10:10] RMI Flag of Buffer 10 (rh) */
    unsigned int RMI11:1;                   /**< \brief [11:11] RMI Flag of Buffer 11 (rh) */
    unsigned int RMI12:1;                   /**< \brief [12:12] RMI Flag of Buffer 12 (rh) */
    unsigned int RMI13:1;                   /**< \brief [13:13] RMI Flag of Buffer 13 (rh) */
    unsigned int RMI14:1;                   /**< \brief [14:14] RMI Flag of Buffer 14 (rh) */
    unsigned int RMI15:1;                   /**< \brief [15:15] RMI Flag of Buffer 15 (rh) */
    unsigned int RMI16:1;                   /**< \brief [16:16] RMI Flag of Buffer 16 (rh) */
    unsigned int RMI17:1;                   /**< \brief [17:17] RMI Flag of Buffer 17 (rh) */
    unsigned int RMI18:1;                   /**< \brief [18:18] RMI Flag of Buffer 18 (rh) */
    unsigned int RMI19:1;                   /**< \brief [19:19] RMI Flag of Buffer 19 (rh) */
    unsigned int RMI20:1;                   /**< \brief [20:20] RMI Flag of Buffer 20 (rh) */
    unsigned int RMI21:1;                   /**< \brief [21:21] RMI Flag of Buffer 21 (rh) */
    unsigned int RMI22:1;                   /**< \brief [22:22] RMI Flag of Buffer 22 (rh) */
    unsigned int RMI23:1;                   /**< \brief [23:23] RMI Flag of Buffer 23 (rh) */
    unsigned int RMI24:1;                   /**< \brief [24:24] RMI Flag of Buffer 24 (rh) */
    unsigned int RMI25:1;                   /**< \brief [25:25] RMI Flag of Buffer 25 (rh) */
    unsigned int RMI26:1;                   /**< \brief [26:26] RMI Flag of Buffer 26 (rh) */
    unsigned int RMI27:1;                   /**< \brief [27:27] RMI Flag of Buffer 27 (rh) */
    unsigned int RMI28:1;                   /**< \brief [28:28] RMI Flag of Buffer 28 (rh) */
    unsigned int RMI29:1;                   /**< \brief [29:29] RMI Flag of Buffer 29 (rh) */
    unsigned int RMI30:1;                   /**< \brief [30:30] RMI Flag of Buffer 30 (rh) */
    unsigned int RMI31:1;                   /**< \brief [31:31] RMI Flag of Buffer 31 (rh) */
} Ifx_PSI5_RMIOV_Bits;

/** \brief  RMI Overview Set Register 0 */
typedef struct _Ifx_PSI5_RMISET_Bits
{
    unsigned int RMI0:1;                    /**< \brief [0:0] Set RMI Flag of Buffer 0 (w) */
    unsigned int RMI1:1;                    /**< \brief [1:1] Set RMI Flag of Buffer 1 (w) */
    unsigned int RMI2:1;                    /**< \brief [2:2] Set RMI Flag of Buffer 2 (w) */
    unsigned int RMI3:1;                    /**< \brief [3:3] Set RMI Flag of Buffer 3 (w) */
    unsigned int RMI4:1;                    /**< \brief [4:4] Set RMI Flag of Buffer 4 (w) */
    unsigned int RMI5:1;                    /**< \brief [5:5] Set RMI Flag of Buffer 5 (w) */
    unsigned int RMI6:1;                    /**< \brief [6:6] Set RMI Flag of Buffer 6 (w) */
    unsigned int RMI7:1;                    /**< \brief [7:7] Set RMI Flag of Buffer 7 (w) */
    unsigned int RMI8:1;                    /**< \brief [8:8] Set RMI Flag of Buffer 8 (w) */
    unsigned int RMI9:1;                    /**< \brief [9:9] Set RMI Flag of Buffer 9 (w) */
    unsigned int RMI10:1;                   /**< \brief [10:10] Set RMI Flag of Buffer 10 (w) */
    unsigned int RMI11:1;                   /**< \brief [11:11] Set RMI Flag of Buffer 11 (w) */
    unsigned int RMI12:1;                   /**< \brief [12:12] Set RMI Flag of Buffer 12 (w) */
    unsigned int RMI13:1;                   /**< \brief [13:13] Set RMI Flag of Buffer 13 (w) */
    unsigned int RMI14:1;                   /**< \brief [14:14] Set RMI Flag of Buffer 14 (w) */
    unsigned int RMI15:1;                   /**< \brief [15:15] Set RMI Flag of Buffer 15 (w) */
    unsigned int RMI16:1;                   /**< \brief [16:16] Set RMI Flag of Buffer 16 (w) */
    unsigned int RMI17:1;                   /**< \brief [17:17] Set RMI Flag of Buffer 17 (w) */
    unsigned int RMI18:1;                   /**< \brief [18:18] Set RMI Flag of Buffer 18 (w) */
    unsigned int RMI19:1;                   /**< \brief [19:19] Set RMI Flag of Buffer 19 (w) */
    unsigned int RMI20:1;                   /**< \brief [20:20] Set RMI Flag of Buffer 20 (w) */
    unsigned int RMI21:1;                   /**< \brief [21:21] Set RMI Flag of Buffer 21 (w) */
    unsigned int RMI22:1;                   /**< \brief [22:22] Set RMI Flag of Buffer 22 (w) */
    unsigned int RMI23:1;                   /**< \brief [23:23] Set RMI Flag of Buffer 23 (w) */
    unsigned int RMI24:1;                   /**< \brief [24:24] Set RMI Flag of Buffer 24 (w) */
    unsigned int RMI25:1;                   /**< \brief [25:25] Set RMI Flag of Buffer 25 (w) */
    unsigned int RMI26:1;                   /**< \brief [26:26] Set RMI Flag of Buffer 26 (w) */
    unsigned int RMI27:1;                   /**< \brief [27:27] Set RMI Flag of Buffer 27 (w) */
    unsigned int RMI28:1;                   /**< \brief [28:28] Set RMI Flag of Buffer 28 (w) */
    unsigned int RMI29:1;                   /**< \brief [29:29] Set RMI Flag of Buffer 29 (w) */
    unsigned int RMI30:1;                   /**< \brief [30:30] Set RMI Flag of Buffer 30 (w) */
    unsigned int RMI31:1;                   /**< \brief [31:31] Set RMI Flag of Buffer 31 (w) */
} Ifx_PSI5_RMISET_Bits;

