Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_regdef.h
/** \brief  TEI Overview Set Register 0 */
typedef struct _Ifx_PSI5_TEISET_Bits
{
    unsigned int TEI0:1;                    /**< \brief [0:0] Set TEI Flag of Buffer 0 (w) */
    unsigned int TEI1:1;                    /**< \brief [1:1] Set TEI Flag of Buffer 1 (w) */
    unsigned int TEI2:1;                    /**< \brief [2:2] Set TEI Flag of Buffer 2 (w) */
    unsigned int TEI3:1;                    /**< \brief [3:3] Set TEI Flag of Buffer 3 (w) */
    unsigned int TEI4:1;                    /**< \brief [4:4] Set TEI Flag of Buffer 4 (w) */
    unsigned int TEI5:1;                    /**< \brief [5:5] Set TEI Flag of Buffer 5 (w) */
    unsigned int TEI6:1;                    /**< \brief [6:6] Set TEI Flag of Buffer 6 (w) */
    unsigned int TEI7:1;                    /**< \brief [7:7] Set TEI Flag of Buffer 7 (w) */
    unsigned int TEI8:1;                    /**< \brief [8:8] Set TEI Flag of Buffer 8 (w) */
    unsigned int TEI9:1;                    /**< \brief [9:9] Set TEI Flag of Buffer 9 (w) */
    unsigned int TEI10:1;                   /**< \brief [10:10] Set TEI Flag of Buffer 10 (w) */
    unsigned int TEI11:1;                   /**< \brief [11:11] Set TEI Flag of Buffer 11 (w) */
    unsigned int TEI12:1;                   /**< \brief [12:12] Set TEI Flag of Buffer 12 (w) */
    unsigned int TEI13:1;                   /**< \brief [13:13] Set TEI Flag of Buffer 13 (w) */
    unsigned int TEI14:1;                   /**< \brief [14:14] Set TEI Flag of Buffer 14 (w) */
    unsigned int TEI15:1;                   /**< \brief [15:15] Set TEI Flag of Buffer 15 (w) */
    unsigned int TEI16:1;                   /**< \brief [16:16] Set TEI Flag of Buffer 16 (w) */
    unsigned int TEI17:1;                   /**< \brief [17:17] Set TEI Flag of Buffer 17 (w) */
    unsigned int TEI18:1;                   /**< \brief [18:18] Set TEI Flag of Buffer 18 (w) */
    unsigned int TEI19:1;                   /**< \brief [19:19] Set TEI Flag of Buffer 19 (w) */
    unsigned int TEI20:1;                   /**< \brief [20:20] Set TEI Flag of Buffer 20 (w) */
    unsigned int TEI21:1;                   /**< \brief [21:21] Set TEI Flag of Buffer 21 (w) */
    unsigned int TEI22:1;                   /**< \brief [22:22] Set TEI Flag of Buffer 22 (w) */
    unsigned int TEI23:1;                   /**< \brief [23:23] Set TEI Flag of Buffer 23 (w) */
    unsigned int TEI24:1;                   /**< \brief [24:24] Set TEI Flag of Buffer 24 (w) */
    unsigned int TEI25:1;                   /**< \brief [25:25] Set TEI Flag of Buffer 25 (w) */
    unsigned int TEI26:1;                   /**< \brief [26:26] Set TEI Flag of Buffer 26 (w) */
    unsigned int TEI27:1;                   /**< \brief [27:27] Set TEI Flag of Buffer 27 (w) */
    unsigned int TEI28:1;                   /**< \brief [28:28] Set TEI Flag of Buffer 28 (w) */
    unsigned int TEI29:1;                   /**< \brief [29:29] Set TEI Flag of Buffer 29 (w) */
    unsigned int TEI30:1;                   /**< \brief [30:30] Set TEI Flag of Buffer 30 (w) */
    unsigned int TEI31:1;                   /**< \brief [31:31] Set TEI Flag of Buffer 31 (w) */
} Ifx_PSI5_TEISET_Bits;

/** \brief  Module Time Stamp Register */
typedef struct _Ifx_PSI5_TSR_Bits
{
    unsigned int CTS:24;                    /**< \brief [23:0] Current Time Stamp for the Module (r) */
    unsigned int ETB:3;                     /**< \brief [26:24] External Time Base Select (rw) */
    unsigned int TBS:1;                     /**< \brief [27:27] Time Base Select (rw) */
    unsigned int reserved_28:2;             /**< \brief \internal Reserved */
    unsigned int ACLR:1;                    /**< \brief [30:30] Clear All Current Time Stamp Counters (w) */
    unsigned int CLR:1;                     /**< \brief [31:31] Clear Current Time Stamp for the Module (w) */
} Ifx_PSI5_TSR_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Psi5_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_ACCEN0_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_ACCEN0;

/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_ACCEN1_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_ACCEN1;

/** \brief  Channel Trigger Value Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_CTV_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CH_CTV;

/** \brief  Input and Output Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_IOCR_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_IOCR;

/** \brief  Pulse Generation Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_PGC_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CH_PGC;

/** \brief  Receiver Control Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_RCRA_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_RCRA;

/** \brief  Receiver Control Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_RCRB_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_RCRB;

/** \brief  Receiver Control Register C */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_RCRC_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_RCRC;

