Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_regdef.h
/** \brief  Receive Data Register High */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_RDRH_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_RDRH;

/** \brief  Receive Data Register Low */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_RDRL_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_RDRL;

/** \brief  Receive Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_RSR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CH_RSR;

/** \brief  Send Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SCR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CH_SCR;

/** \brief  Send Data Register High */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SDRH_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_SDRH;

/** \brief  Send Data Register Low */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SDRL_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_SDRL;

/** \brief  Serial Data and Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SDS_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CH_SDS;

/** \brief  Start of Frame Time Stamp Capture Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SFTSC_Bits B;               /**< \brief Bitfield access */
} Ifx_PSI5_CH_SFTSC;

/** \brief  Send Output Register High */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SORH_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_SORH;

/** \brief  Send Output Register Low */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SORL_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_SORL;

/** \brief  Start of Pulse Time Stamp Capture Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SPTSC_Bits B;               /**< \brief Bitfield access */
} Ifx_PSI5_CH_SPTSC;

/** \brief  Send Shift Register High */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SSRH_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_SSRH;

/** \brief  Send Shift Register Low */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_SSRL_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CH_SSRL;

/** \brief  Watch Dog Timer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CH_WDT_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CH_WDT;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CLC_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_CLC;

/** \brief  CRCI Overview Clear Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CRCICLR_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CRCICLR;

/** \brief  CRCI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CRCIOV_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_CRCIOV;

/** \brief  CRCI Overview Set Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_CRCISET_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_CRCISET;

/** \brief  PSI5 Fractional Divider Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_FDR_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_FDR;

/** \brief  Fractional Divider Register for Higher Bit Rate */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_FDRH_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5_FDRH;

/** \brief  Fractional Divider Register for Lower Bit Rate */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_FDRL_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5_FDRL;

/** \brief  Fractional Divider Register for Time Stamp */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_FDRT_Bits B;                   /**< \brief Bitfield access */
} Ifx_PSI5_FDRT;

