Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_regdef.h
/** \brief  Global Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_GCR_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_GCR;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_ID_Bits B;                     /**< \brief Bitfield access */
} Ifx_PSI5_ID;

/** \brief  Interrupt Node Pointer Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INP_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_INP;

/** \brief  Interrupt Clear Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTCLRA_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_INTCLRA;

/** \brief  Interrupt Clear Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTCLRB_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_INTCLRB;

/** \brief  Interrupt Enable Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTENA_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_INTENA;

/** \brief  Interrupt Enable Register B0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTENB_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_INTENB;

/** \brief  Interrupt Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_INTOV;

/** \brief  Interrupt Set Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTSETA_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_INTSETA;

/** \brief  Interrupt Set Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTSETB_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_INTSETB;

/** \brief  Interrupt Status Register A */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTSTATA_Bits B;               /**< \brief Bitfield access */
} Ifx_PSI5_INTSTATA;

/** \brief  Interrupt Status Register B */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_INTSTATB_Bits B;               /**< \brief Bitfield access */
} Ifx_PSI5_INTSTATB;

/** \brief  Kernel Reset Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_KRST0_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_KRST0;

/** \brief  Kernel Reset Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_KRST1_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_KRST1;

/** \brief  Kernel Reset Status Clear Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_KRSTCLR_Bits B;                /**< \brief Bitfield access */
} Ifx_PSI5_KRSTCLR;

/** \brief  MEI Overview Clear Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_MEICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_MEICLR;

/** \brief  MEI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_MEIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_MEIOV;

/** \brief  MEI Overview Set Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_MEISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_MEISET;

/** \brief  NBI Overview Clear Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_NBICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_NBICLR;

/** \brief  NBI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_NBIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_NBIOV;

/** \brief  NBI Overview Set Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_NBISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_NBISET;

/** \brief  NFI Overview Clear Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_NFICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_NFICLR;

