Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_regdef.h
/** \brief  NFI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_NFIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_NFIOV;

/** \brief  NFI Overview Set Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_NFISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_NFISET;

/** \brief  OCDS Control and Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_OCS_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_OCS;

/** \brief  Receive Data FIFO */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RDF_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_RDF;

/** \brief  RDI Overview Clear Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RDICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_RDICLR;

/** \brief  RDI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RDIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_RDIOV;

/** \brief  RDI Overview Set Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RDISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_RDISET;

/** \brief  Receive Data Memor0 High 0y */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RDM_H_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_RDM_H;

/** \brief  Receive Data Memor0 Low 0y */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RDM_L_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_RDM_L;

/** \brief  Receive FIFO Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RFC_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_RFC;

/** \brief  RMI Overview Clear Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RMICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_RMICLR;

/** \brief  RMI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RMIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_RMIOV;

/** \brief  RMI Overview Set Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RMISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_RMISET;

/** \brief  RSI Overview Clear Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RSICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_RSICLR;

/** \brief  RSI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RSIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_RSIOV;

/** \brief  RSI Overview Set Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_RSISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_RSISET;

/** \brief  TEI Overview Clear Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_TEICLR_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_TEICLR;

/** \brief  TEI Overview Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_TEIOV_Bits B;                  /**< \brief Bitfield access */
} Ifx_PSI5_TEIOV;

/** \brief  TEI Overview Set Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_TEISET_Bits B;                 /**< \brief Bitfield access */
} Ifx_PSI5_TEISET;

/** \brief  Module Time Stamp Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_PSI5_TSR_Bits B;                    /**< \brief Bitfield access */
} Ifx_PSI5_TSR;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Psi5_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

