Anyc-Qing/AUTOSAR/core/system/Os/osal/tricore/aurix/TC39x_Source/IFX_base_famework/BaseFramework_TC39xA/0_Src/BaseSw/Sfr_39A/_Reg/IfxPsi5_regdef.h
/** \brief  Protection range */
typedef volatile struct _Ifx_PSI5_CH
{
    Ifx_PSI5_CH_IOCR IOCR;                  /**< \brief 0, Input and Output Control Register  */
    Ifx_PSI5_CH_RCRA RCRA;                  /**< \brief 4, Receiver Control Register A  */
    Ifx_PSI5_CH_RCRB RCRB;                  /**< \brief 8, Receiver Control Register B  */
    Ifx_PSI5_CH_RCRC RCRC;                  /**< \brief C, Receiver Control Register C  */
    Ifx_PSI5_CH_WDT WDT[7];                 /**< \brief 10, Watch Dog Timer Register */
    Ifx_PSI5_CH_RSR RSR;                    /**< \brief 2C, Receive Status Register  */
    Ifx_PSI5_CH_SDS SDS[6];                 /**< \brief 30, Serial Data and Status Register */
    Ifx_PSI5_CH_SPTSC SPTSC;                /**< \brief 48, Start of Pulse Time Stamp Capture Register  */
    Ifx_PSI5_CH_SFTSC SFTSC;                /**< \brief 4C, Start of Frame Time Stamp Capture Register  */
    Ifx_PSI5_CH_RDRL RDRL;                  /**< \brief 50, Receive Data Register Low  */
    Ifx_PSI5_CH_RDRH RDRH;                  /**< \brief 54, Receive Data Register High  */
    Ifx_PSI5_CH_PGC PGC;                    /**< \brief 58, Pulse Generation Control Register  */
    Ifx_PSI5_CH_CTV CTV;                    /**< \brief 5C, Channel Trigger Value Register  */
    Ifx_PSI5_CH_SCR SCR;                    /**< \brief 60, Send Control Register  */
    Ifx_PSI5_CH_SDRL SDRL;                  /**< \brief 64, Send Data Register Low  */
    Ifx_PSI5_CH_SDRH SDRH;                  /**< \brief 68, Send Data Register High  */
    Ifx_PSI5_CH_SSRL SSRL;                  /**< \brief 6C, Send Shift Register Low  */
    Ifx_PSI5_CH_SSRH SSRH;                  /**< \brief 70, Send Shift Register High  */
    Ifx_PSI5_CH_SORL SORL;                  /**< \brief 74, Send Output Register Low  */
    Ifx_PSI5_CH_SORH SORH;                  /**< \brief 78, Send Output Register High  */
    unsigned char reserved_7C[20];          /**< \brief 7C, \internal Reserved */
} Ifx_PSI5_CH;

/** \brief  Receive data memory */
typedef volatile struct _Ifx_PSI5_RDM
{
    Ifx_PSI5_RDM_L L;                       /**< \brief 0, Receive Data Memor0 Low 0y */
    Ifx_PSI5_RDM_H H;                       /**< \brief 4, Receive Data Memor0 High 0y */
} Ifx_PSI5_RDM;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Psi5_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  PSI5 object */
typedef volatile struct _Ifx_PSI5
{
    Ifx_PSI5_CLC CLC;                       /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_PSI5_ID ID;                         /**< \brief 8, Module Identification Register */
    Ifx_PSI5_FDR FDR;                       /**< \brief C, PSI5 Fractional Divider Register */
    Ifx_PSI5_FDRL FDRL;                     /**< \brief 10, Fractional Divider Register for Lower Bit Rate */
    Ifx_PSI5_FDRH FDRH;                     /**< \brief 14, Fractional Divider Register for Higher Bit Rate */
    Ifx_PSI5_FDRT FDRT;                     /**< \brief 18, Fractional Divider Register for Time Stamp */
    Ifx_PSI5_TSR TSRA;                      /**< \brief 1C, Module Time Stamp Register A */
    Ifx_PSI5_TSR TSRB;                      /**< \brief 20, Time Stamp Register B */
    Ifx_PSI5_TSR TSRC;                      /**< \brief 24, Module Time Stamp Register C */
    unsigned char reserved_28[4];           /**< \brief 28, \internal Reserved */
    Ifx_PSI5_GCR GCR;                       /**< \brief 2C, Global Control Register */
    Ifx_PSI5_CH CH[4];                      /**< \brief 30, Protection range */
    unsigned char reserved_270[136];        /**< \brief 270, \internal Reserved */
    Ifx_PSI5_INTOV INTOV;                   /**< \brief 2F8, Interrupt Overview Register */
    Ifx_PSI5_INP INP[4];                    /**< \brief 2FC, Interrupt Node Pointer Register */
    unsigned char reserved_30C[4];          /**< \brief 30C, \internal Reserved */
    Ifx_PSI5_INTSTATA INTSTATA[4];          /**< \brief 310, Interrupt Status Register A */
    unsigned char reserved_320[4];          /**< \brief 320, \internal Reserved */
    Ifx_PSI5_INTSTATB INTSTATB[4];          /**< \brief 324, Interrupt Status Register B */
    unsigned char reserved_334[4];          /**< \brief 334, \internal Reserved */
    Ifx_PSI5_INTSETA INTSETA[4];            /**< \brief 338, Interrupt Set Register A */
    unsigned char reserved_348[4];          /**< \brief 348, \internal Reserved */
    Ifx_PSI5_INTSETB INTSETB[4];            /**< \brief 34C, Interrupt Set Register B */
    unsigned char reserved_35C[4];          /**< \brief 35C, \internal Reserved */
    Ifx_PSI5_INTCLRA INTCLRA[4];            /**< \brief 360, Interrupt Clear Register A */
    unsigned char reserved_370[4];          /**< \brief 370, \internal Reserved */
    Ifx_PSI5_INTCLRB INTCLRB[4];            /**< \brief 374, Interrupt Clear Register A */
    unsigned char reserved_384[4];          /**< \brief 384, \internal Reserved */
    Ifx_PSI5_INTENA INTENA[4];              /**< \brief 388, Interrupt Enable Register A */
    unsigned char reserved_398[4];          /**< \brief 398, \internal Reserved */
    Ifx_PSI5_INTENB INTENB[4];              /**< \brief 39C, Interrupt Enable Register B0 */
    unsigned char reserved_3AC[32];         /**< \brief 3AC, \internal Reserved */
    Ifx_PSI5_OCS OCS;                       /**< \brief 3CC, OCDS Control and Status */
    Ifx_PSI5_ACCEN0 ACCEN0;                 /**< \brief 3D0, Access Enable Register 0 */
    Ifx_PSI5_ACCEN1 ACCEN1;                 /**< \brief 3D4, Access Enable Register 1 */
    Ifx_PSI5_KRST0 KRST0;                   /**< \brief 3D8, Kernel Reset Register 0 */
    Ifx_PSI5_KRST1 KRST1;                   /**< \brief 3DC, Kernel Reset Register 1 */
    Ifx_PSI5_KRSTCLR KRSTCLR;               /**< \brief 3E0, Kernel Reset Status Clear Register */
    Ifx_PSI5_RFC RFC[4];                    /**< \brief 3E4, Receive FIFO Control Register */
    unsigned char reserved_3F4[4];          /**< \brief 3F4, \internal Reserved */
    Ifx_PSI5_RDF RDF[4];                    /**< \brief 3F8, Receive Data FIFO */
    unsigned char reserved_408[4];          /**< \brief 408, \internal Reserved */
    Ifx_PSI5_RSIOV RSIOV[4];                /**< \brief 40C, RSI Overview Register */
    unsigned char reserved_41C[4];          /**< \brief 41C, \internal Reserved */
    Ifx_PSI5_RMIOV RMIOV[4];                /**< \brief 420, RMI Overview Register */
    unsigned char reserved_430[4];          /**< \brief 430, \internal Reserved */
    Ifx_PSI5_NBIOV NBIOV[4];                /**< \brief 434, NBI Overview Register */
    unsigned char reserved_444[4];          /**< \brief 444, \internal Reserved */
    Ifx_PSI5_TEIOV TEIOV[4];                /**< \brief 448, TEI Overview Register */
    unsigned char reserved_458[4];          /**< \brief 458, \internal Reserved */
    Ifx_PSI5_CRCIOV CRCIOV[4];              /**< \brief 45C, CRCI Overview Register */
    unsigned char reserved_46C[4];          /**< \brief 46C, \internal Reserved */
    Ifx_PSI5_RDIOV RDIOV[4];                /**< \brief 470, RDI Overview Register */
    unsigned char reserved_480[4];          /**< \brief 480, \internal Reserved */
    Ifx_PSI5_NFIOV NFIOV[4];                /**< \brief 484, NFI Overview Register */
    unsigned char reserved_494[4];          /**< \brief 494, \internal Reserved */
    Ifx_PSI5_MEIOV MEIOV[4];                /**< \brief 498, MEI Overview Register */
    unsigned char reserved_4A8[4];          /**< \brief 4A8, \internal Reserved */
    Ifx_PSI5_RSISET RSISET[4];              /**< \brief 4AC, RSI Overview Set Register 0 */
    unsigned char reserved_4BC[4];          /**< \brief 4BC, \internal Reserved */
    Ifx_PSI5_RMISET RMISET[4];              /**< \brief 4C0, RMI Overview Set Register 0 */
    unsigned char reserved_4D0[4];          /**< \brief 4D0, \internal Reserved */
    Ifx_PSI5_NBISET NBISET[4];              /**< \brief 4D4, NBI Overview Set Register 0 */
    unsigned char reserved_4E4[4];          /**< \brief 4E4, \internal Reserved */
    Ifx_PSI5_TEISET TEISET[4];              /**< \brief 4E8, TEI Overview Set Register 0 */
    unsigned char reserved_4F8[4];          /**< \brief 4F8, \internal Reserved */
    Ifx_PSI5_CRCISET CRCISET[4];            /**< \brief 4FC, CRCI Overview Set Register 0 */
    unsigned char reserved_50C[4];          /**< \brief 50C, \internal Reserved */
    Ifx_PSI5_RDISET RDISET[4];              /**< \brief 510, RDI Overview Set Register 0 */
    unsigned char reserved_520[4];          /**< \brief 520, \internal Reserved */
    Ifx_PSI5_NFISET NFISET[4];              /**< \brief 524, NFI Overview Set Register 0 */
    unsigned char reserved_534[4];          /**< \brief 534, \internal Reserved */
    Ifx_PSI5_MEISET MEISET[4];              /**< \brief 538, MEI Overview Set Register 0 */
    unsigned char reserved_548[4];          /**< \brief 548, \internal Reserved */
    Ifx_PSI5_RSICLR RSICLR[4];              /**< \brief 54C, RSI Overview Clear Register 0 */
    unsigned char reserved_55C[4];          /**< \brief 55C, \internal Reserved */
    Ifx_PSI5_RMICLR RMICLR[4];              /**< \brief 560, RMI Overview Clear Register 0 */
    unsigned char reserved_570[4];          /**< \brief 570, \internal Reserved */
    Ifx_PSI5_NBICLR NBICLR[4];              /**< \brief 574, NBI Overview Clear Register 0 */
    unsigned char reserved_584[4];          /**< \brief 584, \internal Reserved */
    Ifx_PSI5_TEICLR TEICLR[4];              /**< \brief 588, TEI Overview Clear Register 0 */
    unsigned char reserved_598[4];          /**< \brief 598, \internal Reserved */
    Ifx_PSI5_CRCICLR CRCICLR[4];            /**< \brief 59C, CRCI Overview Clear Register 0 */
    unsigned char reserved_5AC[4];          /**< \brief 5AC, \internal Reserved */
    Ifx_PSI5_RDICLR RDICLR[4];              /**< \brief 5B0, RDI Overview Clear Register 0 */
    unsigned char reserved_5C0[4];          /**< \brief 5C0, \internal Reserved */
    Ifx_PSI5_NFICLR NFICLR[4];              /**< \brief 5C4, NFI Overview Clear Register 0 */
    unsigned char reserved_5D4[4];          /**< \brief 5D4, \internal Reserved */
    Ifx_PSI5_MEICLR MEICLR[4];              /**< \brief 5D8, MEI Overview Clear Register 0 */
    unsigned char reserved_5E8[24];         /**< \brief 5E8, \internal Reserved */
    Ifx_PSI5_RDM RDM[4][32];                /**< \brief 600, Receive data memory */
    unsigned char reserved_A00[256];        /**< \brief A00, \internal Reserved */
} Ifx_PSI5;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPSI5_REGDEF_H */
